In [1]:
import pandas as pd

In [33]:
titanic = pd.read_csv('../../data/titanic.csv')
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
names = df['Name']
print(names[0])

Braund, Mr. Owen Harris

In [4]:
df.set_index('Ticket', inplace=True)

In [18]:
df.loc['STON/O2. 3101282', 'Name']

'Heikkinen, Miss. Laina'

In [21]:
print(df.iloc[2:5, 2:4])

                  Pclass                                          Name
Ticket
STON/O2. 3101282       3                        Heikkinen, Miss. Laina
113803                 1  Futrelle, Mrs. Jacques Heath (Lily May Peel)
373450                 3                      Allen, Mr. William Henry

In [25]:
df = pd.DataFrame([1,2,3,4,5], columns=['one'])     
# Aggiunta di una nuova colonna
df['two'] = df['one'] * 2
df

   one  two
0    1    2
1    2    4
2    3    6
3    4    8
4    5   10

In [27]:
df_add = pd.DataFrame([[6,7]], columns=['one', 'two']) 

pd.concat([df, df_add])

   one  two
0    1    2
1    2    4
2    3    6
3    4    8
4    5   10
0    6    7

In [30]:
print(pd.concat([df, df_add], axis=1))

   one  two  one  two
0    1    2  6.0  7.0
1    2    4  NaN  NaN
2    3    6  NaN  NaN
3    4    8  NaN  NaN
4    5   10  NaN  NaN

In [35]:
men = titanic[(titanic['Age'] > 18) & (titanic['Sex'] == 'male')]
print(men.head())

    PassengerId  Survived  Pclass                            Name   Sex   Age  \
0             1         0       3         Braund, Mr. Owen Harris  male  22.0
4             5         0       3        Allen, Mr. William Henry  male  35.0
6             7         0       1         McCarthy, Mr. Timothy J  male  54.0
12           13         0       3  Saundercock, Mr. William Henry  male  20.0
13           14         0       3     Andersson, Mr. Anders Johan  male  39.0

    SibSp  Parch     Ticket     Fare Cabin Embarked
0       1      0  A/5 21171   7.2500   NaN        S
4       0      0     373450   8.0500   NaN        S
6       0      0      17463  51.8625   E46        S
12      0      0  A/5. 2151   8.0500   NaN        S
13      1      5     347082  31.2750   NaN        S